#+PROPERTY: header-args :tangle no
* Map Operations

** Warmup
Let's say we've got the following array:

#+NAME: people
#+begin_src js
const people = ["Colin", "Tim", "Mariella"];
#+end_src

#+NAME: mapped-people
#+begin_src js
<<people>>
const attendanceQuestions = people.map((person) => `Is ${person} here today?`)
#+end_src

#+begin_src js
<<mapped-people>>
console.log(attendanceQuestions)
#+end_src

#+RESULTS:
: [
:   'Is Colin here today?',
:   'Is Tim here today?',
:   'Is Mariella here today?'
: ]


** Nitter
#+NAME: imports
#+begin_src js
const colors = require('colors');
#+end_src


#+NAME: tweets
#+begin_src js
const tweets = [
  {
    username: 'dril',
    text: 'Update from the good time line—Bacion is legal to eat at work thanks to President Banksy in the whitehouse, now known as the star wars house',
    displayName: 'wint',
    postId: 2,
    likes: 3999,
    replies: 137
  },
  {
    username: 'Leemanish',
    displayName: 'blake',
    text: 'Sick of having to go to 2 different huts to buy pizza & sunglasses.',
    postId: 3,
    likes: 4736,
    replies: 15
  },
  {
    username: 'queer_queenie',
    displayName: 'Queenie',
    text: `i hold a gender reveal party. all my relatives wait as i pull off the cake cover. the icing says "gender is a spectrum". it's too late, i have the powerpoint up`,
    postId: 4,
    likes: 8349,
    replies: 132
  },
  {
    username: 'phranqueigh',
    displayName: 'Frankie Zelnick',
    text: "How dare you call me mentally unstable, on this, the day of my cat's quinceanera.",
    postId: 5,
    likes: 3612,
    replies: 16
  }
];

console.log(tweets)
#+end_src

#+RESULTS: tweets
#+begin_example
[
  {
    username: 'dril',
    text: 'Update from the good time line—Bacion is legal to eat at work thanks to President Banksy in the whitehouse, now known as the star wars house',
    displayName: 'wint',
    postId: 2,
    likes: 3999,
    replies: 137
  },
  {
    username: 'Leemanish',
    displayName: 'blake',
    text: 'Sick of having to go to 2 different huts to buy pizza & sunglasses.',
    postId: 3,
    likes: 4736,
    replies: 15
  },
  {
    username: 'queer_queenie',
    displayName: 'Queenie',
    text: `i hold a gender reveal party. all my relatives wait as i pull off the cake cover. the icing says "gender is a spectrum". it's too late, i have the powerpoint up`,
    postId: 4,
    likes: 8349,
    replies: 132
  },
  {
    username: 'phranqueigh',
    displayName: 'Frankie Zelnick',
    text: "How dare you call me mentally unstable, on this, the day of my cat's quinceanera.",
    postId: 5,
    likes: 3612,
    replies: 16
  }
]
#+end_example

#+NAME: convertNumber
#+begin_src js
const convertNumber = (number) => {
  if (number < 1000) {
    return number.toString();
  }

  return (Math.floor(number / 100) / 10).toString() + 'K'
}
#+end_src

#+NAME: getDisplayTweets
#+begin_src js
const getDisplayTweets = (tweet) => (`${tweet.displayName}
@${tweet.username}

${tweet.text}

${tweet.likes} Likes   ${tweet.replies} Replies`)
#+end_src

#+NAME: getDisplayTweetsColor
#+begin_src js
<<convertNumber>>

const getDisplayTweets = (tweet) => (`${tweet.displayName.blue}
@${tweet.username}

${tweet.text}

💙 ${convertNumber(tweet.likes).bold}  🗨 ${convertNumber(tweet.replies).bold}  🔗 Copy Link`)
#+end_src

#+RESULTS: getDisplayTweetsColor

#+begin_src js
<<tweets>>
<<getDisplayTweets>>
const tweet = getDisplayTweets(tweets[0]);
console.log(tweet)
#+end_src

#+RESULTS:
: wint
: @dril
: 
: Update from the good time line—Bacion is legal to eat at work thanks to President Banksy in the whitehouse, now known as the star wars house
: 
: 2139 Likes   NaN Replies


#+begin_src js 
<<tweets>>

const tweetStrings = [];
for (let i = 0; i < tweets.length; i++) {
  const tweet = tweets[i];
  const tweetString = `${tweet.displayName}
@${tweet.username}

${tweet.text}

${tweet.retweets} Retweets   ${tweet.likes} Likes   ${tweet.replies} Replies`
  tweetStrings.push(tweetString);
}

tweetStrings.forEach((tweetString) => console.log(tweetString + '\n\n'))
#+end_src

#+RESULTS:
#+begin_example
wint
@dril

Update from the good time line—Bacion is legal to eat at work thanks to President Banksy in the whitehouse, now known as the star wars house

1200 Retweets   8200 Likes   28 Replies


blake
@Leemanish

Sick of having to go to 2 different huts to buy pizza & sunglasses.

2900 Retweets   6300 Likes   210 Replies


Queenie
@queer_queenie

i hold a gender reveal party. all my relatives wait as i pull off the cake cover. the icing says "gender is a spectrum". it's too late, i have the powerpoint up

16900 Retweets   70600 Likes   730 Replies


Frankie Zelnick
@phranqueigh

How dare you call me mentally unstable, on this, the day of my cat's quinceanera.

5000 Retweets   9300 Likes   121 Replies


#+end_example

#+begin_src js :tangle nitter.js
<<imports>>

<<tweets>>

<<getDisplayTweetsColor>>

const displayTweets = tweets.map(getDisplayTweets);
displayTweets.forEach((displayTweet) => console.log(displayTweet + '\n'))
#+end_src

#+RESULTS:
